[
  {
    "id": 1,
    "name": "Luminizing Serum",
    "price": 39,
    "description": "A hydrating serum that leaves your skin glowing naturally.",
    "fullDescription": "Our Luminizing Serum is crafted with pure botanical extracts and hyaluronic acid to deeply hydrate and illuminate your skin. This lightweight formula absorbs quickly, leaving behind a natural, dewy glow that enhances your skin's natural radiance. Perfect for all skin types, use morning and evening for best results.",
    "image": "https://images.unsplash.com/photo-1620916566398-39f1143ab7be?w=800&h=800&fit=crop",
    "ingredients": "Hyaluronic Acid, Botanical Extracts, Vitamin C, Aloe Vera",
    "size": "30ml",
    "reviews": [
      {
        "name": "Sarah M.",
        "rating": 5,
        "comment": "Absolutely love this serum! My skin has never looked better. It gives me such a natural glow and feels so lightweight. Worth every penny!",
        "date": "2 weeks ago",
        "verified": true
      },
      {
        "name": "Emma L.",
        "rating": 5,
        "comment": "This is now a staple in my skincare routine. My skin feels so hydrated and looks radiant. Highly recommend!",
        "date": "1 month ago",
        "verified": true
      },
      {
        "name": "Jessica K.",
        "rating": 4,
        "comment": "Great product! I've noticed my skin is brighter and more even-toned. The only downside is I wish the bottle was bigger.",
        "date": "3 weeks ago",
        "verified": true
      },
      {
        "name": "Rachel T.",
        "rating": 5,
        "comment": "This serum is a game-changer! My complexion has improved so much. It's worth the investment for sure.",
        "date": "5 days ago",
        "verified": true
      },
      {
        "name": "Michelle B.",
        "rating": 5,
        "comment": "I've been using this for a month and my skin texture has improved dramatically. It's lightweight and doesn't break me out.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Jennifer W.",
        "rating": 4,
        "comment": "Really nice serum! It gives a nice glow and my skin feels plump. Will definitely repurchase.",
        "date": "4 days ago",
        "verified": true
      }
    ]
  },
  {
    "id": 2,
    "name": "Bloom Lip Tint",
    "price": 22,
    "description": "A soft blush of color with nourishing botanical oils.",
    "fullDescription": "Bloom Lip Tint offers a delicate wash of color that enhances your natural lip tone while providing deep nourishment. Infused with botanical oils and shea butter, this tinted balm keeps your lips soft, supple, and beautifully colored throughout the day. Available in three natural shades that adapt to your unique lip color.",
    "image": "https://images.unsplash.com/photo-1631217868264-e5b90bb7e133?w=800&h=800&fit=crop",
    "ingredients": "Shea Butter, Botanical Oils, Natural Pigments, Beeswax",
    "size": "4.5g",
    "reviews": [
      {
        "name": "Olivia R.",
        "rating": 5,
        "comment": "Perfect natural color! It's so moisturizing and the color is beautiful. I wear it every day now.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Mia T.",
        "rating": 4,
        "comment": "Love the color and how it feels on my lips. Very natural looking and hydrating.",
        "date": "2 weeks ago",
        "verified": true
      },
      {
        "name": "Sophie K.",
        "rating": 5,
        "comment": "This is my new favorite lip product! The color is perfect and it keeps my lips so soft. Love it!",
        "date": "3 days ago",
        "verified": true
      },
      {
        "name": "Lily P.",
        "rating": 5,
        "comment": "Beautiful tint and incredibly moisturizing. I use it multiple times a day. The color lasts nicely too!",
        "date": "6 days ago",
        "verified": true
      },
      {
        "name": "Grace M.",
        "rating": 4,
        "comment": "Nice natural color and very hydrating. Perfect for everyday wear. Wish it came in more shades though.",
        "date": "1 week ago",
        "verified": true
      }
    ]
  },
  {
    "id": 3,
    "name": "Velvet Skin Cream",
    "price": 34,
    "description": "A lightweight moisturizer for smooth, radiant skin.",
    "fullDescription": "Experience the luxurious feel of our Velvet Skin Cream, a lightweight yet deeply hydrating moisturizer that leaves your skin feeling silky smooth. Formulated with ceramides and natural emollients, this cream creates a protective barrier while maintaining your skin's natural moisture balance. Suitable for daily use, morning and night.",
    "image": "https://images.unsplash.com/photo-1556228578-0d85b1a4d571?w=800&h=800&fit=crop",
    "ingredients": "Ceramides, Natural Emollients, Jojoba Oil, Vitamin E",
    "size": "50ml",
    "reviews": [
      {
        "name": "Sophia C.",
        "rating": 5,
        "comment": "This cream is amazing! My skin feels so soft and smooth. It's not greasy at all and absorbs quickly. Perfect for my combination skin.",
        "date": "3 days ago",
        "verified": true
      },
      {
        "name": "Isabella W.",
        "rating": 5,
        "comment": "Best moisturizer I've tried! My skin looks and feels incredible. The texture is perfect - not too heavy, not too light.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Ava H.",
        "rating": 4,
        "comment": "Really nice cream, very hydrating. My skin feels plump and moisturized all day. Would buy again!",
        "date": "2 weeks ago",
        "verified": true
      },
      {
        "name": "Charlotte D.",
        "rating": 5,
        "comment": "This cream is perfect! It's lightweight but super hydrating. My skin feels like velvet. Highly recommend!",
        "date": "5 days ago",
        "verified": true
      },
      {
        "name": "Amelia F.",
        "rating": 4,
        "comment": "Great moisturizer! It's non-greasy and my skin loves it. Perfect for daily use.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Harper L.",
        "rating": 5,
        "comment": "Love this cream! My skin is so soft and glowing. It's become an essential part of my routine.",
        "date": "4 days ago",
        "verified": true
      }
    ]
  },
  {
    "id": 4,
    "name": "Botanical Cleansing Balm",
    "price": 28,
    "description": "A gentle, nourishing cleanser that melts away makeup and impurities.",
    "fullDescription": "Our Botanical Cleansing Balm transforms from a rich balm to a silky oil upon contact with your skin, effortlessly removing makeup, sunscreen, and daily impurities. Enriched with chamomile and calendula extracts, it soothes and calms while cleansing, leaving your skin soft, clean, and never stripped. Perfect for all skin types, especially sensitive skin.",
    "image": "https://images.unsplash.com/photo-1571875257727-256c39da42af?w=800&h=800&fit=crop",
    "ingredients": "Chamomile Extract, Calendula Oil, Jojoba Oil, Vitamin E",
    "size": "100ml",
    "reviews": [
      {
        "name": "Charlotte B.",
        "rating": 5,
        "comment": "This balm removes all my makeup so easily, even waterproof mascara! My skin feels clean but never dry. Love it!",
        "date": "5 days ago",
        "verified": true
      },
      {
        "name": "Amelia D.",
        "rating": 4,
        "comment": "Great cleanser! It's gentle on my sensitive skin and removes makeup really well. The texture is lovely too.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Evelyn S.",
        "rating": 5,
        "comment": "Best cleansing balm I've used! It melts makeup away effortlessly and leaves my skin feeling so soft. Highly recommend!",
        "date": "3 days ago",
        "verified": true
      },
      {
        "name": "Abigail K.",
        "rating": 5,
        "comment": "This balm is incredible! It removes everything without stripping my skin. My face feels clean and hydrated. Perfect!",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Emily R.",
        "rating": 4,
        "comment": "Really nice cleansing balm. It's gentle and effective. My skin feels great after using it.",
        "date": "6 days ago",
        "verified": true
      }
    ]
  },
  {
    "id": 5,
    "name": "Rosewater Toner",
    "price": 24,
    "description": "A refreshing, hydrating toner that balances and prepares your skin.",
    "fullDescription": "Infused with pure rosewater and botanical extracts, our Rosewater Toner provides instant hydration while balancing your skin's pH levels. This gentle formula soothes irritation, minimizes pores, and prepares your skin for optimal product absorption. Lightweight and refreshing, it's the perfect addition to your daily skincare routine.",
    "image": "https://images.unsplash.com/photo-1608248543803-ba4f8c70ae0b?w=800&h=800&fit=crop",
    "ingredients": "Pure Rosewater, Witch Hazel, Aloe Vera, Glycerin",
    "size": "150ml",
    "reviews": [
      {
        "name": "Harper F.",
        "rating": 5,
        "comment": "This toner is so refreshing! I use it morning and night. My skin feels balanced and looks clearer. The rosewater scent is divine!",
        "date": "4 days ago",
        "verified": true
      },
      {
        "name": "Evelyn G.",
        "rating": 5,
        "comment": "Perfect toner! It's gentle, hydrating, and smells amazing. My pores look smaller and my skin feels so refreshed.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Abigail J.",
        "rating": 4,
        "comment": "Really nice toner. It's very gentle and doesn't irritate my skin. I notice my skin is more balanced since using it.",
        "date": "2 weeks ago",
        "verified": true
      },
      {
        "name": "Mia H.",
        "rating": 5,
        "comment": "Love this toner! The rosewater scent is lovely and it makes my skin feel so refreshed. It's now a staple in my routine.",
        "date": "3 days ago",
        "verified": true
      },
      {
        "name": "Lily N.",
        "rating": 4,
        "comment": "Great toner! It's hydrating and helps balance my skin. The scent is pleasant and it's very gentle.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Grace P.",
        "rating": 5,
        "comment": "This toner is amazing! My skin looks clearer and feels so balanced. I can't imagine my routine without it now.",
        "date": "5 days ago",
        "verified": true
      }
    ]
  },
  {
    "id": 6,
    "name": "Lunar Eye Cream",
    "price": 42,
    "description": "A luxurious eye cream that reduces fine lines and dark circles.",
    "fullDescription": "Wake up to brighter, more youthful-looking eyes with our Lunar Eye Cream. This rich, yet lightweight formula targets fine lines, dark circles, and puffiness with a blend of peptides, caffeine, and botanical extracts. The delicate eye area receives gentle care, leaving you looking refreshed and radiant every morning.",
    "image": "https://images.unsplash.com/photo-1620916566398-39f1143ab7be?w=800&h=800&fit=crop",
    "ingredients": "Peptides, Caffeine, Cucumber Extract, Hyaluronic Acid",
    "size": "15ml",
    "reviews": [
      {
        "name": "Emily N.",
        "rating": 5,
        "comment": "This eye cream is fantastic! I've noticed my dark circles are much lighter and my under-eye area looks smoother. Worth the investment!",
        "date": "6 days ago",
        "verified": true
      },
      {
        "name": "Madison P.",
        "rating": 4,
        "comment": "Really nice eye cream. It's lightweight and doesn't cause any irritation. I think it's helping with my fine lines.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Chloe T.",
        "rating": 5,
        "comment": "Best eye cream I've tried! My under-eye area looks so much brighter and less puffy. Highly recommend this!",
        "date": "4 days ago",
        "verified": true
      },
      {
        "name": "Victoria W.",
        "rating": 5,
        "comment": "This eye cream works wonders! My dark circles have definitely improved and the skin around my eyes feels so smooth.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Samantha K.",
        "rating": 4,
        "comment": "Nice eye cream. It's gentle and hydrating. I've noticed some improvement in my fine lines. Good product!",
        "date": "3 days ago",
        "verified": true
      }
    ]
  },
  {
    "id": 7,
    "name": "Glow Face Mask",
    "price": 32,
    "description": "A brightening mask that reveals luminous, glowing skin.",
    "fullDescription": "Treat your skin to a weekly ritual with our Glow Face Mask. This creamy, botanical-rich formula gently exfoliates while deeply hydrating, revealing brighter, more even-toned skin. Infused with natural fruit enzymes and botanical extracts, it leaves your complexion looking refreshed, radiant, and beautifully smooth.",
    "image": "https://images.unsplash.com/photo-1556229010-6c3f2c9ca5f8?w=800&h=800&fit=crop",
    "ingredients": "Papaya Enzymes, Turmeric Extract, Honey, Kaolin Clay",
    "size": "50ml",
    "reviews": [
      {
        "name": "Chloe Q.",
        "rating": 5,
        "comment": "This mask is amazing! My skin looks so much brighter after using it. I use it once a week and my complexion has never looked better!",
        "date": "3 days ago",
        "verified": true
      },
      {
        "name": "Victoria S.",
        "rating": 5,
        "comment": "Love this mask! It leaves my skin feeling so smooth and looking radiant. The texture is perfect and it doesn't dry out my skin.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Grace U.",
        "rating": 4,
        "comment": "Great mask! I notice my skin is brighter and more even-toned. It's gentle and doesn't irritate my sensitive skin.",
        "date": "2 weeks ago",
        "verified": true
      },
      {
        "name": "Aria M.",
        "rating": 5,
        "comment": "This mask is incredible! My skin looks glowing after every use. It's become a weekly treat for my skin. Highly recommend!",
        "date": "5 days ago",
        "verified": true
      },
      {
        "name": "Layla B.",
        "rating": 4,
        "comment": "Really nice mask! It brightens my complexion and leaves my skin feeling smooth. Perfect for weekly pampering.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Zoe C.",
        "rating": 5,
        "comment": "My favorite mask! It gives such a beautiful glow and my skin feels amazing afterward. Worth every penny!",
        "date": "4 days ago",
        "verified": true
      }
    ]
  },
  {
    "id": 8,
    "name": "Nourishing Face Oil",
    "price": 45,
    "description": "A luxurious blend of botanical oils for radiant, supple skin.",
    "fullDescription": "Indulge your skin with our Nourishing Face Oil, a carefully curated blend of precious botanical oils. This lightweight yet deeply nourishing formula absorbs quickly, delivering essential fatty acids and antioxidants to restore your skin's natural glow. Perfect for dry and mature skin, or as an overnight treatment for all skin types.",
    "image": "https://images.unsplash.com/photo-1611930022073-b7a4ba5fcccd?w=800&h=800&fit=crop",
    "ingredients": "Argan Oil, Rosehip Oil, Jojoba Oil, Vitamin E",
    "size": "30ml",
    "reviews": [
      {
        "name": "Lily V.",
        "rating": 5,
        "comment": "This face oil is incredible! My skin drinks it up and looks so radiant. It's not greasy at all and absorbs beautifully. My new favorite!",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Natalie X.",
        "rating": 5,
        "comment": "Perfect for my dry skin! This oil has transformed my complexion. My skin feels so nourished and looks glowing.",
        "date": "2 weeks ago",
        "verified": true
      },
      {
        "name": "Hannah Z.",
        "rating": 5,
        "comment": "Amazing face oil! It's so luxurious and my skin absolutely loves it. I wake up with glowing, hydrated skin. Worth it!",
        "date": "4 days ago",
        "verified": true
      },
      {
        "name": "Avery L.",
        "rating": 4,
        "comment": "Great oil! It's lightweight and absorbs well. My dry skin feels much more nourished. Really nice product.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Scarlett R.",
        "rating": 5,
        "comment": "This oil is fantastic! My skin looks so radiant and feels incredibly soft. It's perfect for my mature skin. Love it!",
        "date": "6 days ago",
        "verified": true
      }
    ]
  },
  {
    "id": 9,
    "name": "Gentle Exfoliating Scrub",
    "price": 26,
    "description": "A gentle, natural exfoliant that smooths and brightens your complexion.",
    "fullDescription": "Reveal smoother, brighter skin with our Gentle Exfoliating Scrub. Formulated with fine bamboo powder and natural fruit extracts, this scrub gently removes dead skin cells without irritation. The creamy base enriched with botanical oils ensures your skin feels soft, smooth, and beautifully polished after each use.",
    "image": "https://images.unsplash.com/photo-1608571423902-eed4a5ad8108?w=800&h=800&fit=crop",
    "ingredients": "Bamboo Powder, Apricot Kernel Oil, Sugar Cane Extract, Aloe Vera",
    "size": "75ml",
    "reviews": [
      {
        "name": "Zoe Y.",
        "rating": 4,
        "comment": "Nice scrub! It's gentle enough for my sensitive skin but still effective. My skin feels smooth and looks brighter.",
        "date": "5 days ago",
        "verified": true
      },
      {
        "name": "Hannah Z.",
        "rating": 5,
        "comment": "This scrub is perfect! It's not too harsh and leaves my skin feeling so smooth. I use it twice a week and love the results.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Penelope A.",
        "rating": 5,
        "comment": "Love this scrub! It's gentle but effective. My skin feels so smooth and looks brighter. Perfect for sensitive skin!",
        "date": "3 days ago",
        "verified": true
      },
      {
        "name": "Riley B.",
        "rating": 4,
        "comment": "Great exfoliator! It's not too abrasive and my skin feels polished afterward. Nice gentle scrub for regular use.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Eleanor C.",
        "rating": 5,
        "comment": "This scrub is amazing! My skin feels so smooth and looks radiant. I use it weekly and it's become a must-have.",
        "date": "4 days ago",
        "verified": true
      }
    ]
  },
  {
    "id": 10,
    "name": "Hydrating Mist",
    "price": 18,
    "description": "A refreshing facial mist that instantly hydrates and revitalizes your skin.",
    "fullDescription": "Keep your skin refreshed and hydrated throughout the day with our Hydrating Mist. This lightweight, fine-mist formula delivers instant moisture and a burst of botanical goodness. Perfect for setting makeup, refreshing your skin, or providing a quick hydration boost whenever you need it. The gentle formula is suitable for all skin types.",
    "image": "https://images.unsplash.com/photo-1608248543803-ba4f8c70ae0b?w=800&h=800&fit=crop",
    "ingredients": "Hyaluronic Acid, Cucumber Extract, Green Tea, Aloe Vera",
    "size": "100ml",
    "reviews": [
      {
        "name": "Aria A.",
        "rating": 5,
        "comment": "I carry this mist everywhere! It's so refreshing and gives my skin an instant boost. Perfect for setting makeup too!",
        "date": "2 days ago",
        "verified": true
      },
      {
        "name": "Layla B.",
        "rating": 4,
        "comment": "Great mist! It's very hydrating and feels so nice on the skin. I use it throughout the day to refresh my makeup.",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Nora D.",
        "rating": 5,
        "comment": "This mist is perfect! I use it multiple times a day. It's so refreshing and keeps my skin hydrated. Love it!",
        "date": "3 days ago",
        "verified": true
      },
      {
        "name": "Elena F.",
        "rating": 5,
        "comment": "Amazing mist! It's become essential in my routine. My skin feels so refreshed and hydrated. Highly recommend!",
        "date": "1 week ago",
        "verified": true
      },
      {
        "name": "Ivy G.",
        "rating": 4,
        "comment": "Nice hydrating mist! It's perfect for on-the-go hydration. The mist is fine and feels great on the skin.",
        "date": "5 days ago",
        "verified": true
      },
      {
        "name": "Maya H.",
        "rating": 5,
        "comment": "This mist is fantastic! I use it to set my makeup and throughout the day. My skin loves it. Must-have product!",
        "date": "4 days ago",
        "verified": true
      }
    ]
  }
]
